ici-test-automation-feature-environment-readiness/ic-integration-tests/src/test/resources/captia/dokumentScenario/CreateDocument_envelope.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://skat.dk/begrebsmodel/2009/01/15/">
    <soapenv:Header/>
    <soapenv:Body>
        <ns:DokumentMultiOpret_I>
            <ns:Kontekst>
                <tsk:HovedOplysninger xmlns:tsk="http://skat.dk/begrebsmodel/xml/schemas/kontekst/2007/05/31/">
                    <tsk:TransaktionsID>49705142-cb3f-4428-b507-c0235fc744be_TEST</tsk:TransaktionsID>
                    <tsk:TransaktionsTid>2016-11-29T12:04:22Z</tsk:TransaktionsTid>
                </tsk:HovedOplysninger>
            </ns:Kontekst>
            <ns:DokumentListeOplysninger>
                <ns:SagIdentifikationValg>
                    <ns:EnhedsagIdentifikation>
                        <ns:SagNummer>${Properties#SagNummer}</ns:SagNummer>
                    </ns:EnhedsagIdentifikation>
                </ns:SagIdentifikationValg>
                <ns:DokumentListe>
                    <ns:Dokument>
                        <ns:DokumentProfilValg>
                            <ns:DokumentProfilOplysninger>
                                <ns:DokumentGruppe>1000</ns:DokumentGruppe>
                                <ns:DokumentType>A</ns:DokumentType>
                                <ns:DokumentTilstand>ARK</ns:DokumentTilstand>
                            </ns:DokumentProfilOplysninger>
                        </ns:DokumentProfilValg>
                        <ns:DokumentIndex>0</ns:DokumentIndex>
                        <ns:DokumentTitel>${Properties#DokumentTitel}</ns:DokumentTitel>
                        <ns:DokumentFilIndhold>dGVzdA==</ns:DokumentFilIndhold>
                        <ns:DokumentFilType>pdf</ns:DokumentFilType>
                        <ns:DokumentFilEncoding>UTF8</ns:DokumentFilEncoding>
                        <ns:DokumentOprindelse>EFI</ns:DokumentOprindelse>
                        <ns:Aktering>1</ns:Aktering>
                        <ns:DokumentUUID>${Properties#DokumentUUID}</ns:DokumentUUID>
                        <ns:Sagsbehandler>
                            <ns:RessourceNummer>W95640</ns:RessourceNummer>
                        </ns:Sagsbehandler>
                        <ns:OrganisatoriskEnhedNiveauEt>
                            <ns:OrganisatoriskEnhedNummer>801221</ns:OrganisatoriskEnhedNummer>
                        </ns:OrganisatoriskEnhedNiveauEt>
                        <ns:OrganisatoriskEnhedNiveauTo>
                            <ns:OrganisatoriskEnhedNummer>8012</ns:OrganisatoriskEnhedNummer>
                        </ns:OrganisatoriskEnhedNiveauTo>
                        <ns:OrganisatoriskEnhedNiveauTre>
                            <ns:OrganisatoriskEnhedNummer>208000</ns:OrganisatoriskEnhedNummer>
                        </ns:OrganisatoriskEnhedNiveauTre>
                        <ns:DokumentPartListe/>
                        <ns:DokumentHenvisningListe/>
                        <ns:DokumentErindringListe/>
                        <ns:DokumentFriDatoListe/>
                        <ns:DokumentFriOplysningListe/>
                    </ns:Dokument>
                </ns:DokumentListe>
            </ns:DokumentListeOplysninger>
        </ns:DokumentMultiOpret_I>
    </soapenv:Body>
</soapenv:Envelope>